notes/resources/webpack/webpack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-13 Thu 20:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Webpack</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Webpack</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org87a03d9">1. First init npm and install dependencies</a></li>
<li><a href="#org144ff09">2. Create the config file</a>
<ul>
<li><a href="#orgc1b0604">2.1. Add this to the package.json</a></li>
<li><a href="#orgacf6937">2.2. webpack.config.js sample</a></li>
<li><a href="#orgf7ad971">2.3. Adding plugins</a></li>
<li><a href="#orgce70059">2.4. Adding modules</a></li>
</ul>
</li>
<li><a href="#org01bd620">3. Running webpack</a></li>
<li><a href="#org2f55649">4. Serving with auto-refresh</a></li>
</ul>
</div>
</div>
<p>
<a href="../../index.html">Home Page</a>
</p>

<div id="outline-container-org87a03d9" class="outline-2">
<h2 id="org87a03d9"><span class="section-number-2">1</span> First init npm and install dependencies</h2>
<div class="outline-text-2" id="text-1">
<p class="verse">
<code>npm init</code><br />
<code>npm install webpack --save-dev</code><br />
<code>npm install webpack-dev-server --save-dev</code><br />
</p>
</div>
</div>

<div id="outline-container-org144ff09" class="outline-2">
<h2 id="org144ff09"><span class="section-number-2">2</span> Create the config file</h2>
<div class="outline-text-2" id="text-2">
<p class="verse">
<code>touch webpack.config.js</code><br />
</p>
</div>

<div id="outline-container-orgc1b0604" class="outline-3">
<h3 id="orgc1b0604"><span class="section-number-3">2.1</span> Add this to the package.json</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-json"><span style="color: #51afef; font-style: italic;">"scripts"</span>: <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">"test"</span>: <span style="color: #98be65;">"echo \"Error: no test specified\" &amp;&amp; exit 1"</span>,
    <span style="color: #51afef; font-style: italic;">"build"</span>: <span style="color: #98be65;">"webpack-dev-server"</span>,
    <span style="color: #51afef; font-style: italic;">"build:prod"</span>: <span style="color: #98be65;">"webpack"</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacf6937" class="outline-3">
<h3 id="orgacf6937"><span class="section-number-3">2.2</span> webpack.config.js sample</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #51afef; font-style: italic;">var</span> <span style="color: #db5762;">path</span> = require <span style="color: #fff0f5;">(</span><span style="color: #98be65;">'path'</span><span style="color: #fff0f5;">)</span>;  <span style="color: #5B6268;">// </span><span style="color: #5B6268;">helps to create an absolute path</span>

module.exports = <span style="color: #fff0f5;">{</span>
    entry: <span style="color: #98be65;">'./js/comand.js'</span>,
    output: <span style="color: #c678dd;">{</span>
        path: path.resolve<span style="color: #98be65;">(</span>__dirname, <span style="color: #98be65;">'dist'</span><span style="color: #98be65;">)</span>,
        filename: <span style="color: #98be65;">'bundle.js'</span>,
        publicPath: <span style="color: #98be65;">'/dist'</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf7ad971" class="outline-3">
<h3 id="orgf7ad971"><span class="section-number-3">2.3</span> Adding plugins</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Add a package via <code>npm install package_name --save-dev</code></li>
<li>Add plugins to the webpack.config.js, example:</li>
</ul>
<p class="verse">
plugins: [<br />
&#xa0;&#xa0;&#xa0;&#xa0;new webpack.ProvidePlugin({<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;$: "jquery",<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;jQuery: "jquery"<br />
&#xa0;&#xa0;&#xa0;&#xa0;}),<br />
&#xa0;&#xa0;&#xa0;&#xa0;new webpack.ProvidePlugin({<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;BigPicture: "bigpicture",<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;bigpicture: "bigpicture"<br />
&#xa0;&#xa0;&#xa0;&#xa0;})<br />
]<br />
</p>
</div>
</div>

<div id="outline-container-orgce70059" class="outline-3">
<h3 id="orgce70059"><span class="section-number-3">2.4</span> Adding modules</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<ol class="org-ol">
<li><a id="org4dfc3cc"></a>Adding modules to webpack.config.js<br />
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>example of adding a css loader</li>
</ul>
<p class="verse">
module: {<br />
&#xa0;&#xa0;&#xa0;&#xa0;rules: [<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;{<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;test: <i>\.css$</i>,<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;use: [<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;'style-loader',<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;'css-loader'<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;]<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;}<br />
</p>
</div>
</li>

<li><a id="orgdeb3a4e"></a>CSS modules<br />
<div class="outline-text-4" id="text-2-4-2">
<ul class="org-ul">
<li><code>npm install css-loader style-loader --save-dev</code></li>
</ul>
</div>
</li>

<li><a id="orgf8c0d63"></a>File and URL loaders<br />
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li><code>npm install file-loader url-loader --save-dev</code></li>
</ul>
</div>
</li>

<li><a id="org903ed41"></a>Extract loader<br />
<div class="outline-text-4" id="text-2-4-4">
<ul class="org-ul">
<li><code>npm install extract-loader extract-text-webpack html-loader html-webpack-plugin --save-dev</code></li>
</ul>
</div>
</li>

<li><a id="orgba050e4"></a>For es2015<br />
<div class="outline-text-4" id="text-2-4-5">
<ul class="org-ul">
<li><code>npm install babel-core babel-loader babel-preset-es2015 --save-dev</code></li>
</ul>
</div>
</li>

<li><a id="org96bf103"></a>For cleaning the dist<br />
<div class="outline-text-4" id="text-2-4-6">
<ul class="org-ul">
<li><code>npm install clean-webpack-plugin --save-dev</code></li>
</ul>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org01bd620" class="outline-2">
<h2 id="org01bd620"><span class="section-number-2">3</span> Running webpack</h2>
<div class="outline-text-2" id="text-3">
<p class="verse">
<code>npm run build</code><br />
<code>npm run build:prod</code><br />
</p>
</div>
</div>

<div id="outline-container-org2f55649" class="outline-2">
<h2 id="org2f55649"><span class="section-number-2">4</span> Serving with auto-refresh</h2>
<div class="outline-text-2" id="text-4">
<p class="verse">
Open up the app in the browser as:<br />
<code>http://localhost:8080/webpack-dev-server/index.html</code><br />
</p>


<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-05-26 Fri 10:28</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2018-12-13 Thu 20:37</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
